In [ ]:
import numpy as np
import pandas as pd
from sklearn import preprocessing
from sklearn.model_selection import train_test_split 
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
import matplotlib.pyplot as pl
import seaborn as sb
%matplotlib inline

In [ ]:
df_titanic = pd.read_csv('https://raw.githubusercontent.com/luisFernandoCastellanosG/Machine_learning/master/Databasets/dataset_titanic.csv')
df_oil = pd.read_csv('https://raw.githubusercontent.com/luisFernandoCastellanosG/Machine_learning/master/Databasets/petrol_consumption.csv')

In [ ]:
#df_titanic.isnull().sum()
df_titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN          S
1            2         1       1  ...  71.2833   C85          C
2            3         1       3  ...   7.9250   NaN          S
3            4         1       1  ...  53.1000  C123          S
4            5         0       3  ...   8.0500   NaN          S

[5 rows x 12 columns]

In [ ]:
tipos = df_titanic.columns.to_series().groupby(df_titanic.dtypes).groups
ctext = tipos[np.dtype('object')]
len(ctext)
df_titanic.fillna(df_titanic.mean(), inplace = True)
for c in ctext:
    mode = df_titanic[c].mode()[0]
    df_titanic[c] = df_titanic[c].fillna(mode)
le =preprocessing.LabelEncoder()
df_titanic['Sex']=le.fit_transform(df_titanic['Sex'])
le2 =preprocessing.LabelEncoder()
df_titanic['Embarked ']=le2.fit_transform(df_titanic['Embarked '])
df_titanic.head()

   PassengerId  Survived  Pclass  ...     Fare    Cabin  Embarked
0            1         0       3  ...   7.2500  B96 B98          2
1            2         1       1  ...  71.2833      C85          0
2            3         1       3  ...   7.9250  B96 B98          2
3            4         1       1  ...  53.1000     C123          2
4            5         0       3  ...   8.0500  B96 B98          2

[5 rows x 12 columns]

In [ ]:
X= df_titanic[['Age', 'Sex', 'Pclass']]
Y= df_titanic['Survived']
X_train, X_test, Y_train, Y_test = train_test_split (X, Y, test_size=0.3, random_state=10)

In [ ]:
svm = SVC(kernel='linear')
svm.fit(X_train,Y_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='linear',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [ ]:
Y_pred = svm.predict(X_test)
accuracy = accuracy_score(Y_test, Y_pred)
print('Accuracy: '+ str(accuracy*100))

Accuracy: 80.59701492537313

In [ ]:
#df_oil.isnull().sum()
df_oil.head()

   gasolina_impuesto  ...  gasolina_Consumo
0                9.0  ...               541
1                9.0  ...               524
2                9.0  ...               561
3                7.5  ...               414
4                8.0  ...               410

[5 rows x 5 columns]

In [ ]:
Xo = df_oil[['gasolina_impuesto', 'carreteras_pavimentadas' , 'porcen_licencias_conducion_poblacion']]
Yo = df_oil['gasolina_Consumo']
Xo_train, Xo_test, Yo_train, Yo_test = train_test_split (Xo, Yo, test_size=0.2, random_state=40)

In [ ]:
svm = SVC(kernel='linear')
svm.fit(Xo_train,Yo_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='linear',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [ ]:
Yo_pred = svm.predict(Xo_test)
accuracy_oil = accuracy_score(Yo_test, Yo_pred)
print('Accuracy: '+ str(accuracy_oil*100))

Accuracy: 0.0